NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_net_beacon.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdlib.h>

#include <cmock.h>
#include <unity.h>

#include "net_beacon.h"

#include "nrf_mesh.h"
#include "nrf_mesh_externs.h"

#include "beacon_mock.h"
#include "enc_mock.h"
#include "timer_scheduler_mock.h"
#include "rand_mock.h"
#include "timer_mock.h"
#include "net_state_mock.h"
#include "event_mock.h"
#include "advertiser_mock.h"

#include "nordic_common.h"
#include "test_assert.h"
#include "nrf_mesh_events.h"

typedef struct
{
    bool iv_update;
    bool key_refresh;
    uint8_t net_key[NRF_MESH_KEY_SIZE];
    uint32_t iv_index;
    nrf_mesh_beacon_info_t info;

    uint8_t auth[NRF_MESH_KEY_SIZE];
    uint8_t beacon[21]; /**< Without beacon type */
} net_beacon_sample_data_t;

/* Secure network beacon sample packet 1: */
#define SEC_NET_SAMPLE_DATA_1 {                                                                                                                          \
    .iv_update          = false,                                                                                                                         \
    .key_refresh        = false,                                                                                                                         \
    .net_key            = {0x7d, 0xd7, 0x36, 0x4c, 0xd8, 0x42, 0xad, 0x18, 0xc1, 0x7c, 0x2b, 0x82, 0x0c, 0x84, 0xc3, 0xd6},                              \
    .iv_index           = 0x12345678,                                                                                                                    \
    .info.secmat.net_id = {0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70},                                                                              \
    .info.secmat.key    = {0x54, 0x23, 0xd9, 0x67, 0xda, 0x63, 0x9a, 0x99, 0xcb, 0x02, 0x23, 0x1a, 0x83, 0xf7, 0xd2, 0x54},                              \
    .info.iv_update_permitted = true,                                                                                                                    \
    .auth               = {0x8e, 0xa2, 0x61, 0x58, 0x2f, 0x36, 0x4f, 0x6f, 0x3c, 0x74, 0xef, 0x80, 0x33, 0x6c, 0xa1, 0x7e},                              \
    .beacon             = {0x00, 0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70, 0x12, 0x34, 0x56, 0x78, 0x8e, 0xa2, 0x61, 0x58, 0x2f, 0x36, 0x4f, 0x6f} \
}

/* Secure network beacon sample packet 2 (IV update in progress): */
#define SEC_NET_SAMPLE_DATA_2 {                                                                                                                          \
    .iv_update          = true,                                                                                                                          \
    .key_refresh        = false,                                                                                                                         \
    .net_key            = {0x7d, 0xd7, 0x36, 0x4c, 0xd8, 0x42, 0xad, 0x18, 0xc1, 0x7c, 0x2b, 0x82, 0x0c, 0x84, 0xc3, 0xd6},                              \
    .iv_index           = 0x12345679,                                                                                                                    \
    .info.secmat.net_id = {0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70},                                                                              \
    .info.secmat.key    = {0x54, 0x23, 0xd9, 0x67, 0xda, 0x63, 0x9a, 0x99, 0xcb, 0x02, 0x23, 0x1a, 0x83, 0xf7, 0xd2, 0x54},                              \
    .info.iv_update_permitted = true,                                                                                                                    \
    .auth               = {0xc2, 0xaf, 0x80, 0xad, 0x07, 0x2a, 0x13, 0x5c, 0x28, 0xcf, 0x84, 0x33, 0x69, 0x88, 0x70, 0x39},                              \
    .beacon             = {0x02, 0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70, 0x12, 0x34, 0x56, 0x79, 0xc2, 0xaf, 0x80, 0xad, 0x07, 0x2a, 0x13, 0x5c} \
}

/* Secure network beacon sample packet 3 (IV update complete): */
#define SEC_NET_SAMPLE_DATA_3 {                                                                                                                          \
    .iv_update          = false,                                                                                                                         \
    .key_refresh        = false,                                                                                                                         \
    .net_key            = {0x7d, 0xd7, 0x36, 0x4c, 0xd8, 0x42, 0xad, 0x18, 0xc1, 0x7c, 0x2b, 0x82, 0x0c, 0x84, 0xc3, 0xd6},                              \
    .iv_index           = 0x12345679,                                                                                                                    \
    .info.secmat.net_id = {0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70},                                                                              \
    .info.secmat.key    = {0x54, 0x23, 0xd9, 0x67, 0xda, 0x63, 0x9a, 0x99, 0xcb, 0x02, 0x23, 0x1a, 0x83, 0xf7, 0xd2, 0x54},                              \
    .info.iv_update_permitted = true,                                                                                                                    \
    .auth               = {0xc6, 0x2f, 0x09, 0xe4, 0xc9, 0x57, 0xf5, 0x9d, 0x96, 0xf5, 0x06, 0xf6, 0x46, 0x04, 0xbf, 0xc1},                              \
    .beacon             = {0x00, 0x3e, 0xca, 0xff, 0x67, 0x2f, 0x67, 0x33, 0x70, 0x12, 0x34, 0x56, 0x79, 0xc6, 0x2f, 0x09, 0xe4, 0xc9, 0x57, 0xf5, 0x9d} \
}

