NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_net_beacon.c
static uint8_t * mp_expected_net_id;
static nrf_mesh_beacon_info_t ** mpp_infos;
static uint32_t m_info_count;
static uint32_t m_info_index;
static timer_sch_callback_t m_timer_cb;
static uint32_t m_rand_value;
static uint32_t m_time_now;
static advertiser_t * mp_adv;
static advertiser_tx_complete_cb_t m_tx_complete_cb;

void setUp(void)
{
    mp_expected_net_id = NULL;
    m_info_index = 0;
    m_info_count = 0;
    mpp_infos = NULL;
    m_timer_cb = NULL;
    m_time_now = 0;
    beacon_mock_Init();
    net_state_mock_Init();
    timer_scheduler_mock_Init();
    timer_mock_Init();
    enc_mock_Init();
    event_mock_Init();
    advertiser_mock_Init();
}

void tearDown(void)
{
    beacon_mock_Verify();
    beacon_mock_Destroy();
    net_state_mock_Verify();
    net_state_mock_Destroy();
    timer_scheduler_mock_Verify();
    timer_scheduler_mock_Destroy();
    timer_mock_Verify();
    timer_mock_Destroy();
    enc_mock_Verify();
    enc_mock_Destroy();
    event_mock_Verify();
    event_mock_Destroy();
    advertiser_mock_Verify();
    advertiser_mock_Destroy();
}

void nrf_mesh_beacon_info_next_get(const uint8_t * p_network_id, const nrf_mesh_beacon_info_t ** pp_beacon_info,
        nrf_mesh_key_refresh_phase_t * p_subnet_kr_phase)
{
    if (p_network_id == NULL)
    {
        TEST_ASSERT_EQUAL_PTR(NULL, mp_expected_net_id);
    }
    else
    {
        TEST_ASSERT_EQUAL_HEX8_ARRAY(mp_expected_net_id, p_network_id, NRF_MESH_NETID_SIZE);
    }

    TEST_ASSERT_NOT_NULL(mpp_infos);
    TEST_ASSERT_NOT_EQUAL(0, m_info_count);
    TEST_ASSERT_TRUE(m_info_index <= m_info_count);

    if (m_info_index >= m_info_count)
    {
        *pp_beacon_info = NULL;
    }
    else
    {
        if (m_info_index == 0)
        {
            TEST_ASSERT_EQUAL(NULL, *pp_beacon_info);
        }
        *pp_beacon_info = mpp_infos[m_info_index];
        *p_subnet_kr_phase = NRF_MESH_KEY_REFRESH_PHASE_0;
    }

    m_info_index++;
}

void timer_sch_schedule_mock_cb(timer_event_t * p_event, int count)
{
    TEST_ASSERT_NOT_NULL(p_event);
    TEST_ASSERT_NOT_NULL(p_event->cb);
    TEST_ASSERT_EQUAL(SEC_TO_US(NRF_MESH_BEACON_SECURE_NET_BCAST_INTERVAL_SECONDS), p_event->interval);
    TEST_ASSERT_TRUE(m_time_now + SEC_TO_US(NRF_MESH_BEACON_SECURE_NET_BCAST_INTERVAL_SECONDS) > p_event->timestamp);
    TEST_ASSERT_TRUE(m_time_now < p_event->timestamp);
    m_timer_cb = p_event->cb;
}

static void advertiser_instance_init_cb(advertiser_t * p_adv, advertiser_tx_complete_cb_t tx_cb, uint8_t * p_buffer, uint32_t buffer_size, int calls)
{
    TEST_ASSERT_NOT_NULL(p_adv);
    TEST_ASSERT_NOT_NULL(tx_cb);
    TEST_ASSERT_NOT_NULL(p_buffer);
    TEST_ASSERT_EQUAL(ADVERTISER_PACKET_BUFFER_PACKET_MAXLEN, buffer_size);

    mp_adv = p_adv;
    m_tx_complete_cb = tx_cb;
}

void setup_module(void)
{
    m_rand_value = 123456789; // larger than the beacon interval
    rand_hw_rng_get_Expect(NULL, 4);
    rand_hw_rng_get_IgnoreArg_p_result();
    rand_hw_rng_get_ReturnMemThruPtr_p_result((uint8_t*) &m_rand_value, 4);
    uint8_t dummy_salt[NRF_MESH_KEY_SIZE] = {0, 1, 2, 3, 4, 5, 6, 7, 0, 1, 2, 3, 4, 5, 6, 7};
    enc_s1_ExpectWithArray((const uint8_t*) "nkbk", 4, 4, NULL, 0);
    enc_s1_IgnoreArg_p_out();
    enc_s1_ReturnMemThruPtr_p_out(dummy_salt, NRF_MESH_KEY_SIZE);
    timer_now_ExpectAndReturn(1000);
    timer_sch_schedule_StubWithCallback(timer_sch_schedule_mock_cb);
    advertiser_instance_init_StubWithCallback(advertiser_instance_init_cb);
    advertiser_interval_set_Expect(NULL, 1000);
    advertiser_interval_set_IgnoreArg_p_adv();
    advertiser_enable_ExpectAnyArgs();

    net_beacon_init();
    TEST_ASSERT_NOT_NULL(m_timer_cb);
    TEST_ASSERT_NOT_NULL(mp_adv);
}

static void tx_complete(void)
{
    timer_now_ExpectAndReturn(m_time_now);
    m_tx_complete_cb(mp_adv, 0, m_time_now);
}

static void expect_tx(const uint8_t * p_key, const uint8_t * p_beacon_data, uint8_t * p_auth, adv_packet_t * p_adv_packet)
{
    enc_aes_cmac_ExpectWithArray(p_key, NRF_MESH_KEY_SIZE, p_beacon_data, 13, 13, NULL, 0);
    enc_aes_cmac_IgnoreArg_p_result();
    enc_aes_cmac_ReturnMemThruPtr_p_result(p_auth, 8);
    beacon_create_ExpectWithArrayAndReturn(mp_adv, 1, BEACON_TYPE_SEC_NET_BCAST, p_beacon_data, 21, 21, p_adv_packet);
    advertiser_packet_send_Expect(mp_adv, p_adv_packet);
}
/*****************************************************************************
* Tests
*****************************************************************************/
void test_tx_single(void)
{
    setup_module();

    net_beacon_sample_data_t sample_datas[] = {SEC_NET_SAMPLE_DATA_1, SEC_NET_SAMPLE_DATA_2, SEC_NET_SAMPLE_DATA_3};

    /* single sample data */
    for (uint32_t i = 0; i < ARRAY_SIZE(sample_datas); i++)
    {
        nrf_mesh_beacon_tx_info_t tx_info;
        net_beacon_sample_data_t sample_data = sample_datas[i];
        memset(&tx_info, 0, sizeof(tx_info));
        sample_data.info.p_tx_info = &tx_info;

        nrf_mesh_beacon_info_t * p_info[] = {&sample_data.info};
        mpp_infos = p_info;
        m_info_count = 1;
        adv_packet_t adv_packet;

        m_info_index = 0;
        m_time_now = SEC_TO_US(10);

        /* Test packet creation */
        expect_tx(sample_data.info.secmat.key, sample_data.beacon, sample_data.auth, &adv_packet);

        /* Call the timeout */
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);

        tx_complete();

        enc_mock_Verify();

        /* Run again, fail bearer_tx */
        m_info_index = 0;
        m_time_now += SEC_TO_US(10);
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        beacon_create_ExpectWithArrayAndReturn(mp_adv, 1, BEACON_TYPE_SEC_NET_BCAST, sample_data.beacon, 21, 21, NULL);

