NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_net_beacon.c
        /* Call the timeout */
        net_state_beacon_iv_index_get_ExpectAndReturn(sample_data.iv_index);
        net_state_iv_update_get_ExpectAndReturn(sample_data.iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL);
        m_timer_cb(m_time_now, NULL);
        tx_complete();

        enc_mock_Verify();
        beacon_mock_Verify();
    }
}

/**
 * Test that we can run through multiple subnets on tx
 */
void test_tx_multi(void)
{
    setup_module();

#define NETWORKS    5
    /* multiple sample data */
    nrf_mesh_beacon_info_t info[NETWORKS];
    uint8_t beacon_data[NETWORKS][21];
    nrf_mesh_beacon_tx_info_t tx_info[NETWORKS];
    nrf_mesh_beacon_info_t * p_info[NETWORKS];
    adv_packet_t adv_packet;
    uint8_t auth[8];

    memset(&info, 0, sizeof(info));
    memset(&tx_info, 0, sizeof(tx_info));
    memset(auth, 0xAB, sizeof(auth));

    for (uint32_t i = 0; i < NETWORKS; i++)
    {
        memset(&tx_info[i], 0, sizeof(tx_info[i]));
        info[i].p_tx_info = &tx_info[i];
        p_info[i] = &info[i];

        beacon_data[i][0] = 0x00;
        memcpy(&beacon_data[i][1], info[i].secmat.net_id, 8);
        beacon_data[i][9] = 0x12;
        beacon_data[i][10] = 0x34;
        beacon_data[i][11] = 0x56;
        beacon_data[i][12] = 0x78;
        memcpy(&beacon_data[i][13], auth, sizeof(auth));
    }
    mpp_infos = p_info;
    m_info_count = NETWORKS;

    m_info_index = 0;
    m_time_now = SEC_TO_US(10);


    /* Test packet creation */

    for (uint32_t i = 0; i < NETWORKS; i++)
    {
        net_state_beacon_iv_index_get_ExpectAndReturn(0x12345678);
        net_state_iv_update_get_ExpectAndReturn(NET_STATE_IV_UPDATE_NORMAL);
        expect_tx(info[i].secmat.key, &beacon_data[i][0], auth, &adv_packet);

        /* On the first run, we call the timer. The next beacons will be sent as the previous one completed its TX */
        if (i == 0)
        {
            m_timer_cb(m_time_now, NULL);
        }
        else
        {
            tx_complete();
        }
        enc_mock_Verify();
        beacon_mock_Verify();
    }

#undef NETWORKS
}

void test_packet_in(void)
{
    setup_module();

    net_beacon_sample_data_t sample_datas[] = {SEC_NET_SAMPLE_DATA_1, SEC_NET_SAMPLE_DATA_2, SEC_NET_SAMPLE_DATA_3};
    for (uint32_t i = 0; i < ARRAY_SIZE(sample_datas); i++)
    {
        nrf_mesh_beacon_tx_info_t tx_info;
        net_beacon_sample_data_t sample_data = sample_datas[i];
        memset(&tx_info, 0, sizeof(tx_info));

        sample_data.info.p_tx_info = &tx_info;

        nrf_mesh_beacon_info_t * p_info[] = {&sample_data.info};
        mpp_infos = p_info;
        m_info_count = 1;
        mp_expected_net_id = sample_data.info.secmat.net_id;

        nrf_mesh_evt_t evt;
        evt.type                                = NRF_MESH_EVT_NET_BEACON_RECEIVED;
        evt.params.net_beacon.p_beacon_info     = &sample_data.info;
        evt.params.net_beacon.p_beacon_secmat   = &sample_data.info.secmat;
        evt.params.net_beacon.p_rx_metadata     = NULL;
        evt.params.net_beacon.iv_index          = sample_data.iv_index;
        evt.params.net_beacon.flags.iv_update   = sample_data.iv_update;
        evt.params.net_beacon.flags.key_refresh = sample_data.key_refresh;

        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        event_handle_Expect(&evt);
        net_beacon_packet_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(1, sample_data.info.p_tx_info->rx_count[0]);

        /* Try again, should bump the tx count */
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        event_handle_Expect(&evt);
        net_beacon_packet_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(2, sample_data.info.p_tx_info->rx_count[0]);

        /* Try again without permitting IV update. Should still produce an event, and should count the RX */
        sample_data.info.iv_update_permitted = false;
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        event_handle_Expect(&evt);
        net_beacon_packet_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(3, sample_data.info.p_tx_info->rx_count[0]);


        /* Don't roll over the rx count */
        m_info_index = 0;
        sample_data.info.iv_update_permitted = true;
        sample_data.info.p_tx_info->rx_count[0] = 0xFFFF;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);
        event_handle_Expect(&evt);
        net_beacon_packet_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(0xFFFF, sample_data.info.p_tx_info->rx_count[0]);

        /* Invalid auth, shouldn't handle the beacon: */
        uint8_t dummy_auth[NRF_MESH_KEY_SIZE];
        memset(dummy_auth, 0xDA, NRF_MESH_KEY_SIZE);
        sample_data.info.p_tx_info->rx_count[0] = 0;
        m_info_index = 0;
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(dummy_auth, 16);
        net_beacon_packet_in(sample_data.beacon, sizeof(sample_data.beacon), NULL);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count[0]);
    }
}

