NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_net_beacon.c
        /* Verify that the observations move one step back for every interval */
        sample_data.info.p_tx_info->rx_count[0] = 4;
        m_time_now += SEC_TO_US(10);
        m_info_index = 0;
        m_timer_cb(m_time_now, NULL);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count[0]);
        TEST_ASSERT_EQUAL(4, sample_data.info.p_tx_info->rx_count[1]);
        m_time_now += SEC_TO_US(10);
        m_info_index = 0;
        m_timer_cb(m_time_now, NULL);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count[0]);
        TEST_ASSERT_EQUAL(0, sample_data.info.p_tx_info->rx_count[1]);
    }
}

void test_beacon_build(void)
{
    setup_module();

    net_beacon_sample_data_t sample_datas[] = {SEC_NET_SAMPLE_DATA_1, SEC_NET_SAMPLE_DATA_2, SEC_NET_SAMPLE_DATA_3};

    /* single sample data */
    for (uint32_t i = 0; i < ARRAY_SIZE(sample_datas); i++)
    {
        net_beacon_sample_data_t sample_data = sample_datas[i];

        /* Test packet creation */
        enc_aes_cmac_ExpectWithArray(sample_data.info.secmat.key, NRF_MESH_KEY_SIZE, sample_data.beacon, 13, 13, NULL, 0);
        enc_aes_cmac_IgnoreArg_p_result();
        enc_aes_cmac_ReturnMemThruPtr_p_result(sample_data.auth, 16);

        uint8_t buffer[NET_BEACON_BUFFER_SIZE];
        TEST_ASSERT_EQUAL(NRF_SUCCESS,
                          net_beacon_build(&sample_data.info.secmat,
                                           sample_data.iv_index,
                                           sample_data.iv_update,
                                           sample_data.key_refresh,
                                           buffer));
        TEST_ASSERT_EQUAL_HEX8(0x01, buffer[0]);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(sample_data.beacon, &buffer[1], sizeof(buffer) - 1);
    }
}
